cf_billing/InformationRegisters/энргРасписаниеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРасписаниеНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СбрасыватьВзаиморасчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбрасыватьПоказания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсключаяОтдельностоящие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокЗапуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРасписаниеНачислений/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Выборка = РегистрыСведений.энргРасписаниеНачислений.ПолучитьВсеДанныеРегистра();
	ЗаписиРегистра.Загрузить(Выборка.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗакрылиПравильно Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сохраните данные или нажмите кнопку ""Отмена""");
	КонецЕсли;	
КонецПроцедуры
#Конецобласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура СохранитьИЗакрытьНаСервере()
	РегистрыСведений.энргРасписаниеНачислений.ЗаписатьВсеДанныеРегистра(ЗаписиРегистра.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	ЗакрылиПравильно	= Истина;
	Если ЕстьОшибки() Тогда   
		ЗакрылиПравильно	= Ложь;
		Возврат;
	Иначе
		СохранитьИЗакрытьНаСервере();
		Закрыть(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда) 
	ЗакрылиПравильно	= Истина;
	Закрыть();
КонецПроцедуры

#Конецобласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ЗаполнитьВсемиРайонами(Команда)
	Если Не ЗначениеЗаполнено(ПериодНачисления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен период начисления");
		Возврат;
	КонецЕсли;
	ЗаполнитьВсемиРайонамиНаСервере();
КонецПроцедуры

#Конецобласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьВсемиРайонамиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЗоныОтвественности.Организация КАК Организация,
	|	энргЗоныОтвественности.Ссылка КАК Район,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&ИсключаяОтдельностоящие КАК ИсключаяОтдельностоящие,
	|	&СбрасыватьВзаиморасчеты КАК СбрасыватьВзаиморасчеты,
	|	&СбрасыватьПоказания КАК СбрасыватьПоказания
	|ИЗ
	|	Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|ГДЕ
	|	НЕ энргЗоныОтвественности.ПометкаУдаления
	|	И НЕ энргЗоныОтвественности.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ПериодНачисления",			НачалоМесяца(ПериодНачисления)); 
	Запрос.УстановитьПараметр("ИсключаяОтдельностоящие",	ИсключаяОтдельностоящие);
	Запрос.УстановитьПараметр("СбрасыватьВзаиморасчеты",	СбрасыватьВзаиморасчеты);
	Запрос.УстановитьПараметр("СбрасыватьПоказания",		СбрасыватьПоказания);

	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЗаписиРегистра.Добавить(), Выборка);	
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Функция ЕстьОшибки()
	Для Каждого ТекСтрока Из ЗаписиРегистра Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.ПериодНачисления) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен период начисления для района " + ТекСтрока.Район);
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции
#Конецобласти
